Autodesk.Revit.DB.BuiltInFailures.MatchlineFailures.CreationFailed
Matchline top extent should be higher than its bottom.

Autodesk.Revit.DB.BuiltInFailures.MatchlineFailures
Failures about Matchline.